{
  "translation": {
    "home": {
      "header": "Home",
      "hello": "Hello there!",
      "name": "I am Victor Mazzola",
      "roles": {
        "developer": "Software Developer",
        "helpdesk": "IT Helpdesk Intern"
      },
      "text": "Always seeking to enhance my understanding of development to deliver innovative solutions for everyone",
      "skills": "Professional Skills",
      "tools": "Tools I use",
      "languages": {
        "header": "Languages I speak",
        "native": "Native",
        "advanced": "Advanced",
        "intermediate": "Intermediate",
        "basic": "Basic",
        "pt": "Portuguese",
        "uk": "English",
        "it": "Italian",
        "de": "German"
      }
    },
    "projects": {
      "header": "Projects",
      "button": "Check Now",
      "portfolio": {
        "title": "Portfolio",
        "description": "Showcasing my projects and skills using React, TypeScript, Tailwind, and Vite.",
        "modalContent": "This portfolio showcases my growth as a developer. My first portfolio was built using HTML, CSS, and Bootstrap, but this new version applies my knowledge of React, TypeScript, Tailwind, and Vite.",
        "githubRepo": "https://github.com/vicmazzola/portfolio-react",
        "liveDemo": "https://portfolio-react-delta-eight.vercel.app/"
      },
      "calculator": {
        "title": "Calculator",
        "description": "A modern calculator app built with React and Vite, featuring offline functionality through PWA support. Responsive, fast, and easy to use.",
        "modalContent": "Calculator made using React and Vite. It features basic calculator operations for everyday needs, Progressive Web App (PWA) functionality for offline use and installation, and a responsive design for seamless use across devices. Powered by React for a modular UI and Vite for blazing-fast performance",
        "githubRepo": "https://github.com/vicmazzola/react-calc-app",
        "liveDemo": "https://react-calc-app-seven.vercel.app/"
      },
      "shopping-list": {
        "title": "Shopping List",
        "description": "Manage shopping items dynamically using HTML, CSS, JavaScript, and SweetAlert2.",
        "modalContent": "Shopping List simplifies shopping management. Add, edit, delete, and mark items as purchased, with creation dates displayed. Built with HTML, CSS, JavaScript, and SweetAlert2, it's responsive and user-friendly.",
        "githubRepo": "https://github.com/vicmazzola/shopping-list",
        "liveDemo": "https://shopping-list-wine-eta.vercel.app/"
      },
      "teamflow": {
        "title": "TeamFlow",
        "description": "A React app with reusable components, state management, and responsive design. Built with Vite and deployed on Vercel.",
        "modalContent": "Manage teams with collaborative cards, dropdowns, and forms in a dynamic, responsive interface.",
        "githubRepo": "https://github.com/vicmazzola/TeamFlow",
        "liveDemo": "https://team-flow-tan.vercel.app/"
      },
      "codeconnect": {
        "title": "CodeConnect",
        "description": "A React project with dynamic components, state management, and hooks. Built with Vite for fast development.",
        "modalContent": "Create navigation, search, filters, and cards with dynamic React components and efficient state management.",
        "githubRepo": "https://github.com/vicmazzola/codeconnect",
        "liveDemo": "https://codeconnect-feed-seven.vercel.app/"
      },
      "codeconnect-login": {
        "title": "CodeConnect Login",
        "description": "Login module for CodeConnect, showcasing reusable components and modular CSS styling.",
        "modalContent": "Build forms, inputs, and buttons dynamically using React components and state. Modular CSS ensures a clean, responsive layout.",
        "githubRepo": "https://github.com/vicmazzola/code-connect-react",
        "liveDemo": "https://code-connect-react-five.vercel.app/"
      },
      "dev-dragons": {
        "title": "Dev Dragons",
        "description": "RPG-themed app showcasing object-oriented principles like inheritance and dynamic rendering.",
        "modalContent": "An RPG app with OOP concepts, dynamic character cards, and an interactive battle system.",
        "githubRepo": "https://github.com/vicmazzola/dev-dragons",
        "liveDemo": "https://dev-dragons-chi.vercel.app/"
      },
      "codeconnect-post": {
        "title": "CodeConnect Post",
        "description": "A web app for managing posts with dynamic forms and async features.",
        "modalContent": "Manage posts dynamically with image uploads, live previews, tag validation, and responsive forms.",
        "githubRepo": "https://github.com/vicmazzola/code-connect",
        "liveDemo": "https://code-connect-ten-mu.vercel.app/"
      },
      "fokus": {
        "title": "Fokus",
        "description": "A Pomodoro timer with dynamic intervals, audio feedback, and interactive buttons.",
        "modalContent": "A minimalist Pomodoro timer with dynamic styles, responsive interface, and integrated audio feedback.",
        "githubRepo": "https://github.com/vicmazzola/fokus",
        "liveDemo": "https://fokus-tau-rouge.vercel.app/"
      },
      "ifood": {
        "title": "iFood Back-office Solution",
        "description": "A back-office solution for financial management, built with React and secure features.",
        "modalContent": "A project for iFood partners to manage digital transactions securely and efficiently.",
        "githubRepo": "https://github.com/vicmazzola/challenge_ifood",
        "liveDemo": "https://challengeifood-rosy.vercel.app/"
      },
      "about-games": {
        "title": "About Games",
        "description": "A simple site for practicing HTML, CSS, and Bootstrap skills effectively.",
        "modalContent": "A practice project using HTML, CSS, and Bootstrap to improve layout and responsiveness.",
        "githubRepo": "https://github.com/vicmazzola/projeto-ferias",
        "liveDemo": "https://games-consoles.vercel.app/"
      },
      "mazzola-play": {
        "title": "Mazzola's Play",
        "description": "A basic webpage built using HTML, CSS, and responsive Flexbox layouts.",
        "modalContent": "A simple webpage built as part of Flexbox learning with Alura, showcasing responsive designs.",
        "githubRepo": "https://github.com/vicmazzola/mazzolas-play",
        "liveDemo": "https://mazzolas-play.vercel.app/"
      },
      "fintech": {
        "title": "FinPlus",
        "description": "A fintech landing page built using HTML, CSS, and Bootstrap components.",
        "modalContent": "A single-page fintech solution designed with responsive layouts and Bootstrap for front-end class.",
        "githubRepo": "https://github.com/vicmazzola/Fintech",
        "liveDemo": "https://fintechfinplus.vercel.app/"
      },
      "alurabooks": {
        "title": "AluraBooks",
        "description": "An e-commerce platform showcasing books with advanced JavaScript filtering and sorting.",
        "modalContent": "An advanced e-commerce site with JavaScript array methods for filtering, sorting, and responsiveness.",
        "githubRepo": "https://github.com/vicmazzola/alura-books-js",
        "liveDemo": "https://alura-books-js-xi.vercel.app/"
      },
      "guess": {
        "title": "Guess the Number",
        "description": "A guessing game built with HTML, CSS, and JavaScript for practice.",
        "modalContent": "An improved number guessing game featuring dynamic feedback and responsive design for fun interaction.",
        "githubRepo": "https://github.com/vicmazzola/guess-the-number",
        "liveDemo": "https://guess-the-number-gamma-ochre.vercel.app/"
      }
    },
    "aboutme": {
      "header": "About Me",
      "text": "This section contains some informations about me...",
      "certificate": "Certifications",
      "school": {
        "fiap": {
          "company": "FIAP",
          "location": "São Paulo, Brazil",
          "title": "Associate Degree in Systems Analysis and Development",
          "date": "February 2023 - December 2025",
          "description": "Pursuing an associate degree focused on developing technical skills in programming, software development, and systems analysis. This program provides a strong foundation for a career in technology and software engineering."
        }
      },
      "certificates": {
        "button": "See Details",
        "javascriptConcurrentOOP": {
          "title": "Develop Web Applications with JavaScript: Concurrency and OOP",
          "description": "Master asynchronous requests, object manipulation, and advanced JavaScript techniques.",
          "modalContent": "Completed the training 'Develop Scalable Applications with JavaScript: Concurrency and OOP,' totaling 23 hours. Gained expertise in concurrent programming, OOP fundamentals (classes, objects, inheritance), and asynchronous operations to build modern, responsive applications.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-aplicacoes-javascript-tarefas-concorrentes-orientadas-objetoss-543206/certificate?lang=en"

        },
        "reactJSXHooks": {
          "title": "React: Develop Web Applications Using JSX and Hooks",
          "description": "Learn to create dynamic, responsive web apps with React, leveraging modern tools and techniques.",
          "modalContent": "This 58-hour course focused on building dynamic web applications with React. Key highlights include creating components with JSX, managing state and lifecycle, and configuring projects with Node.js and Vite. This experience strengthened my ability to design modern and interactive user interfaces.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-react-jsx-hooks-702713/certificate?lang=en"

        },
        "javascriptFrontEnd": {
          "title": "Front-end Development: courses to create web applications with HTML, CSS and JavaScript",
          "description": "Explore JavaScript from DOM manipulation to advanced ES6+ features across 61 hours of learning.",
          "modalContent": "In this training, I developed skills in DOM manipulation, HTTP CRUD implementation, and asynchronous programming with promises and async/await. I also delved into advanced ES6+ features like destructuring, modules, and modern JavaScript tools like Webpack and Vite.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-javascript-front-end-v814363-814363/certificate?lang=en"

        },
        "htmlCssFromScratch": {
          "title": "From scratch: beginner in programming",
          "description": "Developed solid skills in building and styling web projects using HTML and CSS.",
          "modalContent": "This training provided a comprehensive understanding of how to structure and design web projects from scratch using HTML and CSS. It laid the foundation for creating responsive and accessible websites. Special thanks to Alura and Mônica Hillman for this incredible learning journey.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-html-css-v527396-527396/certificate?lang=en"

        },
        "fortinetFCF": {
          "title": "Fortinet Certified Fundamentals in Cybersecurity (FCF)",
          "description": "Validates essential technical skills for entry-level cybersecurity roles.",
          "modalContent": "This certification covers today's threat landscape and the fundamentals of cybersecurity, ensuring readiness for entry-level positions.",
          "githubRepo": null,
          "liveDemo": null
        },
        "fortinetFCA": {
          "title": "Fortinet Certified Associate in Cybersecurity (FCA)",
          "description": "Validates ability to execute high-level operations on FortiGate devices.",
          "modalContent": "This certification focuses on fundamental operating procedures for common FortiGate features, enhancing network security competencies.",
          "githubRepo": null,
          "liveDemo": null
        },
        "javaFundamentals": {
          "title": "Enhancing the Fundamentals of Java",
          "description": "Extra course at FIAP to deepen knowledge beyond graduation.",
          "modalContent": "I learned about object-oriented programming and how to connect to a database, consolidating essential skills in Java.",
          "githubRepo": null,
          "liveDemo": null
        },
        "userExperience": {
          "title": "User Experience Course at FIAP",
          "description": "Enhancing knowledge in areas of interest beyond the degree.",
          "modalContent": "I learned to create impactful experiences and apply UX fundamentals in future projects.",
          "githubRepo": null,
          "liveDemo": null
        },
        "figmaUnderstanding": {
          "title": "Figma: Understanding the Tool",
          "description": "Learned to use Figma's core tools to create and organize digital projects.",
          "modalContent": "This course provided a comprehensive understanding of Figma, focusing on organizing projects, designing user interfaces (UI), and mastering variables and styles. It strengthened my foundation in UI design and digital product creation.",
          "certificateLink": "https://cursos.alura.com.br/certificate/victormazzola2019/figma-conhecendo-ferramenta?lang=en"

        },
        "pythonFirstApp": {
          "title": "Python: Creating Your First Application",
          "description": "Learned to create Python applications, exploring core programming concepts.",
          "modalContent": "This course introduced Python fundamentals, including string manipulation, modules, functions, lists, loops, exceptions, and dictionaries. It provided a solid foundation for Python application development.",
          "certificateLink": "https://cursos.alura.com.br/certificate/victormazzola2019/python-crie-sua-primeira-aplicacao?lang=en"

        },
        "programmingLogic": {
          "title": "Programming Logic (FIAP)",
          "description": "Course from FIAP issued in March 2024.",
          "modalContent": "I gained skills in logic programming, HTML, programming fundamentals, looping structures, code optimization, and function creation.",
          "githubRepo": null,
          "liveDemo": null
        },
        "uxDesignProcess": {
          "title": "Start the UX Design Process: Empathize, Define, and Ideate (Google)",
          "description": "Certification focused on empathy mapping, user journeys, and user experience.",
          "modalContent": "This Google certification trained me in empathy mapping, defining, and ideating in the UX design process. I learned to develop user journeys and improve user-centered experiences.",
          "githubRepo": null,
          "liveDemo": null
        },
        "uxFoundations": {
          "title": "Foundations of User Experience (UX) Design (Google)",
          "description": "Certification focused on UX research, usability testing, and user-centered design.",
          "modalContent": "I learned the foundations of UX design, including research, usability testing, user-centered design, and design thinking. This certification strengthened my skills in crafting impactful experiences.",
          "githubRepo": null,
          "liveDemo": null
        }


      },
      "job": {
        "goldnet": {
          "company": "Goldnet TI",
          "location": "Jundiaí, São Paulo, Brazil",
          "title": "Helpdesk IT",
          "date": "August 2024 - Present",
          "description": "Goldnet TI is a leading IT services provider offering technical solutions for businesses.\n\nAs a Helpdesk IT, I was responsible for:\n\n· On-site and remote technical support for system and equipment issues.\n· Configuration, maintenance, and support of printers.\n· Level 1 Help Desk support, assisting users with technical issues.\n· Management of account creation, deletion, and permission adjustments in internal systems.\n· First-line support, providing general user assistance."
        },
        "evolution": {
          "company": "Evolution Gaming Group",
          "location": "Birkirkara, Malta",
          "title": "Shuffler",
          "date": "April - October 2023",
          "description": "Evolution is a leading iGaming company renowned for delivering high-quality gaming experiences.\n\nAs a Shuffler, I was responsible for:\n\n· Efficiently managing and shuffling cards to maintain the flow of the game.\n· Ensuring uninterrupted and engaging gameplay for players.\n· Contributing to an uninterrupted and immersive gaming experience."
        },
        "vilaromana": {
          "company": "Vila Romana",
          "location": "Itupeva, São Paulo, Brazil",
          "title": "Salesperson",
          "date": "January - July 2021",
          "description": "Vila Romana is a store specializing in business attire, including shirts, pants, suits, and accessories.\n\nAs a Salesperson, my responsibilities included:\n\n· Assisting customers in selecting and purchasing business clothing and accessories.\n· Providing detailed product information and recommendations based on customer needs.\n· Developing strong communication skills and the ability to interact effectively with a diverse clientele.\n· Maintaining store inventory and ensuring a high standard of customer service."
        },
        "ambev": {
          "company": "Ambev (part of AB InBev)",
          "location": "Jundiaí, São Paulo, Brazil",
          "title": "Apprentice",
          "date": "April 2017 - March 2018",
          "description": "Ambev is a major Brazilian brewing company with a presence in numerous countries.\n\nAs an Apprentice, my responsibilities included:\n\n· Helping with the preparation of employee trainings and the analysis of the post results.\n· Assisting the packaging area managers.\n· Utilizing Microsoft Office Package Tools, such as Excel, for production control and factory training.\n\nI started as an apprentice in Human Resources and was later relocated to Packing. I gained experience working in both the office and production/warehouse environments, developing the ability to interact with every level of the company, from factory workers to managers."
        },
        "adoniroladeira": {
          "company": "Professor Adoniro Ladeira State School",
          "location": "Jundiaí, São Paulo, Brazil",
          "title": "Apprentice",
          "date": "2013",
          "description": "Professor Adoniro Ladeira State School is an educational institution providing quality education to middle and high school students.\n\nAs an Apprentice, my responsibilities included:\n\n· Assisting students from middle school and high school with their computer classes.\n· Helping teachers in the preparation of presentations.\n\nThis experience allowed me to develop my passion for computers."
        }
      }
    }
  }
}

