{
  "translation": {
    "home": {
      "header": "Home",
      "hello": "Olá!",
      "name": "Sou o Victor Mazzola",
      "roles": {
        "developer": "Desenvolvedor de Software",
        "helpdesk": "Estagiário de Helpdesk"
      },
      "text": "Sempre buscando aprimorar meu entendimento sobre desenvolvimento para entregar soluções inovadoras para todos",
      "skills": "Habilidades Profissionais",
      "tools": "Ferramentas que uso",
      "languages": {
        "header": "Línguas",
        "native": "Nativo",
        "advanced": "Fluente",
        "intermediate": "Intermediário",
        "basic": "Básico",
        "pt": "Português",
        "uk": "Inglês",
        "it": "Italiano",
        "de": "Alemão"
      }
    },
    "projects": {
      "header": "Projetos",
      "button": "Confira Agora!",
      "portfolio": {
        "title": "Portfólio",
        "description": "Mostrando meus projetos e habilidades com React, TypeScript, Tailwind e Vite.",
        "modalContent": "Este portfólio destaca meu crescimento como desenvolvedor. Meu primeiro portfólio foi criado com HTML, CSS e Bootstrap, mas esta nova versão aplica meu conhecimento em React, TypeScript, Tailwind e Vite.",
        "githubRepo": "https://github.com/vicmazzola/portfolio-react",
        "liveDemo": "https://portfolio-react-delta-eight.vercel.app/"
      },
      "react-hangman": {
        "title": "React-Hangman",
        "description": "Um jogo da forca moderno e interativo, desenvolvido com React e TypeScript. Aproveite um design elegante, ótimo desempenho e jogabilidade responsiva em qualquer dispositivo.",
        "modalContent": "React-Hangman foi desenvolvido com React e TypeScript para um código escalável, Vite para builds rápidos e Styled Components para um estilo responsivo. Como PWA, oferece suporte offline e instalação em desktop ou mobile.",
        "githubRepo": "https://github.com/vicmazzola/react-hangman",
        "liveDemo": "https://react-hangman-five.vercel.app/"
      },
      "weather": {
        "title": "Weather App",
        "description": "Um aplicativo de clima desenvolvido com React, Vite, Axios, Tailwind CSS e API OpenWeather, oferecendo atualizações climáticas em tempo real e uma interface elegante e responsiva.",
        "modalContent": "O Weather App obtém dados em tempo real usando Axios e a API OpenWeather. Ele exibe informações detalhadas do clima, como temperatura, umidade e velocidade do vento. As buscas recentes são armazenadas no localStorage para acesso rápido. Construído com Tailwind CSS para design responsivo e inclui funcionalidade PWA para uso offline e instalação. Implantado com Vercel para hospedagem rápida.",
        "githubRepo": "https://github.com/vicmazzola/weather-app",
        "liveDemo": "https://weather-app-ten-nu-10.vercel.app/"
      },
      "calculator": {
        "title": "Calculadora",
        "description": "Um aplicativo de calculadora moderno desenvolvido com React e Vite, com suporte offline graças à funcionalidade PWA. Responsivo, rápido e fácil de usar.",
        "modalContent": "Calculadora desenvolvida com React e Vite. Inclui operações básicas para o dia a dia, funcionalidade Progressive Web App (PWA) para uso offline e instalação, além de um design responsivo para uso perfeito em qualquer dispositivo. Alimentada pelo React para uma interface modular e Vite para desempenho ultrarrápido.",
        "githubRepo": "https://github.com/vicmazzola/react-calc-app",
        "liveDemo": "https://react-calc-app-seven.vercel.app/"
      },
      "shopping-list": {
        "title": "Lista de Compras",
        "description": "Gerencie itens de compras dinamicamente com HTML, CSS, JavaScript e SweetAlert2.",
        "modalContent": "Shopping List simplifica o gerenciamento de compras. Adicione, edite, exclua e marque itens como comprados, com datas de criação exibidas. Feito com HTML, CSS, JavaScript e SweetAlert2, é responsivo e fácil de usar.",
        "githubRepo": "https://github.com/vicmazzola/shopping-list",
        "liveDemo": "https://shopping-list-wine-eta.vercel.app/"
      },
      "teamflow": {
        "title": "TeamFlow",
        "description": "Uma aplicação React com componentes reutilizáveis, gerenciamento de estado e design responsivo. Construída com Vite em JavaScript, posteriormente migrada para TypeScript, e implantada no Vercel.",
        "modalContent": "Gerencie equipes com cards, dropdowns e formulários em uma interface dinâmica e responsiva.",
        "githubRepo": "https://github.com/vicmazzola/TeamFlow",
        "liveDemo": "https://team-flow-tan.vercel.app/"
      },
      "codeconnect": {
        "title": "CodeConnect",
        "description": "Um projeto React com componentes dinâmicos, gerenciamento de estado e hooks. Criado com Vite para desenvolvimento rápido.",
        "modalContent": "Crie navegação, busca, filtros e cards com componentes React dinâmicos e gerenciamento eficiente de estado.",
        "githubRepo": "https://github.com/vicmazzola/codeconnect",
        "liveDemo": "https://codeconnect-feed-seven.vercel.app/"
      },
      "codeconnect-login": {
        "title": "CodeConnect Login",
        "description": "Módulo de login para CodeConnect, com componentes reutilizáveis e CSS modular.",
        "modalContent": "Crie formulários, inputs e botões dinamicamente com componentes React e estado. O CSS modular garante um layout limpo e responsivo.",
        "githubRepo": "https://github.com/vicmazzola/code-connect-react",
        "liveDemo": "https://code-connect-react-five.vercel.app/"
      },
      "dev-dragons": {
        "title": "Dev Dragons",
        "description": "App RPG que usa OOP, com herança e renderização dinâmica.",
        "modalContent": "Um app RPG com conceitos de POO, cartas de personagens dinâmicas e sistema de batalha interativo.",
        "githubRepo": "https://github.com/vicmazzola/dev-dragons",
        "liveDemo": "https://dev-dragons-chi.vercel.app/"
      },
      "codeconnect-post": {
        "title": "CodeConnect Post",
        "description": "App para gerenciar posts com formulários dinâmicos e recursos assíncronos.",
        "modalContent": "Gerencie posts dinamicamente com upload de imagens, pré-visualizações ao vivo e validação de tags.",
        "githubRepo": "https://github.com/vicmazzola/code-connect",
        "liveDemo": "https://code-connect-ten-mu.vercel.app/"
      },
      "fokus": {
        "title": "Fokus",
        "description": "Timer Pomodoro com intervalos dinâmicos, feedback sonoro e botões interativos.",
        "modalContent": "Um timer minimalista Pomodoro com estilos dinâmicos, interface responsiva e feedback sonoro integrado.",
        "githubRepo": "https://github.com/vicmazzola/fokus",
        "liveDemo": "https://fokus-tau-rouge.vercel.app/"
      },
      "ifood": {
        "title": "iFood Back-office",
        "description": "Solução back-office para gestão financeira, criada com React e recursos seguros.",
        "modalContent": "Projeto para parceiros iFood gerenciarem transações digitais de forma segura e eficiente.",
        "githubRepo": "https://github.com/vicmazzola/challenge_ifood",
        "liveDemo": "https://challengeifood-rosy.vercel.app/"
      },
      "about-games": {
        "title": "Sobre Games",
        "description": "Um site simples para praticar habilidades em HTML, CSS e Bootstrap.",
        "modalContent": "Projeto prático usando HTML, CSS e Bootstrap para melhorar layout e responsividade.",
        "githubRepo": "https://github.com/vicmazzola/projeto-ferias",
        "liveDemo": "https://games-consoles.vercel.app/"
      },
      "mazzola-play": {
        "title": "Mazzola's Play",
        "description": "Página web básica feita com HTML, CSS e layouts Flexbox responsivos.",
        "modalContent": "Uma página simples desenvolvida como parte do aprendizado de Flexbox na Alura.",
        "githubRepo": "https://github.com/vicmazzola/mazzolas-play",
        "liveDemo": "https://mazzolas-play.vercel.app/"
      },
      "fintech": {
        "title": "FinPlus",
        "description": "Página fintech construída com HTML, CSS e componentes do Bootstrap.",
        "modalContent": "Solução de página única para fintech com layouts responsivos e uso de Bootstrap.",
        "githubRepo": "https://github.com/vicmazzola/Fintech",
        "liveDemo": "https://fintechfinplus.vercel.app/"
      },
      "alurabooks": {
        "title": "AluraBooks",
        "description": "Plataforma e-commerce para livros com filtros avançados e ordenação em JavaScript.",
        "modalContent": "Site e-commerce avançado com métodos de arrays JavaScript para filtros, ordenação e responsividade.",
        "githubRepo": "https://github.com/vicmazzola/alura-books-js",
        "liveDemo": "https://alura-books-js-xi.vercel.app/"
      },
      "guess": {
        "title": "Adivinhe o Número",
        "description": "Jogo de adivinhação criado com HTML, CSS e JavaScript.",
        "modalContent": "Jogo de adivinhação melhorado com feedback dinâmico e design responsivo para uma interação divertida.",
        "githubRepo": "https://github.com/vicmazzola/guess-the-number",
        "liveDemo": "https://guess-the-number-gamma-ochre.vercel.app/"
      }
    },
    "aboutme": {
      "header": "Sobre Mim",
      "text": "Aqui contém algumas informações sobre mim...",
      "certificate": "Certificados",
      "school": {
        "fiap": {
          "company": "FIAP",
          "location": "São Paulo, Brasil",
          "title": "Tecnólogo em Análise e Desenvolvimento de Sistemas",
          "date": "Fevereiro de 2023 - Dezembro de 2025",
          "description": "Cursando tecnólogo com foco no desenvolvimento de habilidades técnicas em programação, desenvolvimento de software e análise de sistemas. Este curso oferece uma base sólida para uma carreira em tecnologia e engenharia de software."
        }
      },
      "certificates": {
        "button": "Ver Detalhes",
        "javascriptConcurrentOOP": {
          "title": "Desenvolva Aplicações Escaláveis com JavaScript: Concorrência e POO",
          "description": "Domine requisições assíncronas, manipulação de objetos e técnicas avançadas de JavaScript.",
          "modalContent": "Concluí a formação 'Desenvolva Aplicações Escaláveis com JavaScript: Concorrência e POO,' totalizando 23 horas. Aprimorei habilidades em programação concorrente, fundamentos de POO (classes, objetos, herança) e operações assíncronas para criar aplicações modernas e responsivas.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-aplicacoes-javascript-tarefas-concorrentes-orientadas-objetoss-543206/certificate?lang=pt"
        },
        "reactJSXHooks": {
          "title": "React: Desenvolva Aplicações Web Usando JSX e Hooks",
          "description": "Aprenda a desenvolver aplicações web dinâmicas e responsivas com React, utilizando ferramentas modernas.",
          "button": "Veja Mais",
          "modalContent": "Essa formação de 58 horas foi focada no desenvolvimento de aplicações web dinâmicas com React. Entre os destaques, estão a criação de componentes com JSX, gerenciamento de estado e ciclo de vida, além da configuração de projetos com Node.js e Vite. Essa experiência fortaleceu minha capacidade de projetar interfaces modernas e interativas.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-react-jsx-hooks-702713/certificate?lang=pt"
        },
        "javascriptFrontEnd": {
          "title": "Desenvolvimento Front-end: cursos para criar aplicações web com HTML, CSS e JavaScript",
          "description": "Explore o JavaScript desde a manipulação do DOM até recursos avançados do ES6+ em 61 horas de aprendizado.",
          "modalContent": "Nesta formação, desenvolvi habilidades em manipulação do DOM, implementação de CRUDs com HTTP e programação assíncrona com promises e async/await. Também aprofundei o uso de recursos avançados do ES6+, como destructuring, módulos e ferramentas modernas como Webpack e Vite.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-javascript-front-end-v814363-814363/certificate?lang=pt_BR"
        },
        "htmlCssFromScratch": {
          "title": "A partir do zero: iniciante em programação",
          "description": "Desenvolvi habilidades sólidas para criar e estilizar projetos web utilizando HTML e CSS.",
          "modalContent": "Essa formação me proporcionou uma compreensão completa de como estruturar e estilizar projetos web do zero usando HTML e CSS. Foi a base para criar sites responsivos e acessíveis. Agradeço à Alura e à Mônica Hillman por essa incrível jornada de aprendizado.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/degree-html-css-v527396-527396/certificate?lang=pt"
        },
        "fortinetFCF": {
          "title": "Fortinet Certified Fundamentals in Cybersecurity (FCF)",
          "description": "Valida habilidades técnicas essenciais para funções iniciais em cibersegurança.",
          "modalContent": "Esta certificação abrange o panorama atual das ameaças e os fundamentos da cibersegurança, garantindo prontidão para posições de nível inicial.",
          "certificateLink": "https://www.credly.com/badges/77e81017-87f0-409f-814b-15a6219532ba"
        },
        "fortinetFCA": {
          "title": "Fortinet Certified Associate in Cybersecurity (FCA)",
          "description": "Valida a capacidade de executar operações de alto nível em dispositivos FortiGate.",
          "modalContent": "Esta certificação foca nos procedimentos operacionais fundamentais para recursos comuns do FortiGate, aprimorando competências em segurança de rede.",
          "certificateLink": "https://www.credly.com/badges/25ab537f-ee4e-4818-aa1f-34d22e93ed41"
        },
        "javaFundamentals": {
          "title": "Java Fundamentos",
          "description": "Curso extra na FIAP para aprofundar conhecimentos além da graduação.",
          "modalContent": "Aprendi sobre orientação a objetos e como conectar a um banco de dados, consolidando habilidades essenciais em Java.",
          "certificateLink": "https://on.fiap.com.br/pluginfile.php/1/local_nanocourses/certificado_nanocourse/128744/e132292f182164e0a27396aeff0ee5d7/certificado.png"
        },
        "userExperience": {
          "title": "Curso em User Experience",
          "description": "Aprimorando conhecimentos em áreas de interesse além da formação.",
          "modalContent": "Aprendi a criar experiências impactantes e a aplicar fundamentos de UX em projetos futuros.",
          "certificateLink": "https://on.fiap.com.br/pluginfile.php/1/local_nanocourses/certificado_nanocourse/125339/b61d5d81ca9bca2d7a17e20934fc4b03/certificado.png"
        },
        "figmaUnderstanding": {
          "title": "Figma: Entendendo a Ferramenta",
          "description": "Aprendi a usar as ferramentas principais do Figma para criar e organizar projetos digitais.",
          "modalContent": "Este curso me proporcionou uma compreensão completa do Figma, com foco na organização de projetos, design de interfaces de usuário (UI) e no domínio de variáveis e estilos. Fortaleceu minha base em design de UI e criação de produtos digitais.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/course/figma-conhecendo-ferramenta/certificate?lang=pt_BR"

        },
        "pythonFirstApp": {
          "title": "Python: Crie a sua primeira aplicação",
          "description": "Aprendi a criar aplicações em Python, explorando conceitos fundamentais de programação.",
          "modalContent": "Este curso apresentou os fundamentos do Python, incluindo manipulação de strings, módulos, funções, listas, loops, exceções e dicionários. Foi uma base sólida para o desenvolvimento de aplicações em Python.",
          "certificateLink": "https://cursos.alura.com.br/user/victormazzola2019/course/python-crie-sua-primeira-aplicacao/certificate?lang=pt_BR"

        },
        "programmingLogic": {
          "title": "Lógica de Programação",
          "description": "Curso da FIAP emitido em Março de 2024.",
          "modalContent": "Adquiri habilidades como lógica de programação, HTML, fundamentos de programação, estruturas de repetição, otimização de código e criação de funções.",
          "certificateLink": "https://on.fiap.com.br/pluginfile.php/1/local_nivelamento/certificado_nivelamento/1506/015fc77bb2dc0af76fbb4e0b639338c5/certificado.png"

        },
        "uxDesignProcess": {
          "title": "Inicie o Processo de Design UX: Empatizar, Definir e Idear",
          "description": "Certificação obtida com foco em mapeamento de empatia, jornadas do usuário e experiência do usuário.",
          "modalContent": "Esta certificação da Google me capacitou em mapeamento de empatia, definição e ideação no processo de design de UX. Aprendi a desenvolver jornadas do usuário e aprimorar experiências centradas no usuário.",
          "certificateLink": "https://www.coursera.org/account/accomplishments/verify/KKV8SKXUDFDW"

        },
        "uxFoundations": {
          "title": "Fundamentos do Design de Experiência do Usuário (UX) ",
          "description": "Certificação obtida com foco em pesquisa de UX, testes de usabilidade e design centrado no usuário.",
          "modalContent": "Aprendi os fundamentos do design de UX, incluindo pesquisa, testes de usabilidade, design centrado no usuário e pensamento de design. Esta certificação fortaleceu minhas habilidades em projetar experiências impactantes.",
          "certificateLink": "https://www.coursera.org/account/accomplishments/verify/CT3KLCQGP4M4"

        }
      },
      "job": {
        "goldnet": {
          "company": "Goldnet TI",
          "location": "Jundiaí, São Paulo, Brasil",
          "title": "Helpdesk TI",
          "date": "Agosto 2024 - Presente",
          "description": "A Goldnet TI é um fornecedor líder de serviços de TI, oferecendo soluções técnicas para empresas.\n\nComo Helpdesk TI, fui responsável por:\n\n· Suporte técnico presencial e remoto para resolução de problemas relacionados a sistemas e equipamentos.\n· Configuração, manutenção e suporte de impressoras.\n· Atendimento de suporte Help Desk de nível 1, auxiliando usuários na solução de problemas técnicos.\n· Gestão de criação, exclusão e ajuste de permissões em contas de sistemas internos.\n· Realização de primeiro atendimento, oferecendo suporte geral aos usuários."
        },
        "evolution": {
          "company": "Evolution Gaming Group",
          "location": "Birkirkara, Malta",
          "title": "Shuffler",
          "date": "Abril - Outubro 2023",
          "description": "A Evolution é uma empresa líder em iGaming, renomada por oferecer experiências de jogos de alta qualidade.\n\nComo Shuffler, fui responsável por:\n\n· Fornecer cartas de forma eficiente para manter o fluxo do jogo.\n· Garantir uma jogabilidade envolvente e contínua para os jogadores.\n· Contribuir para uma experiência de jogo ininterrupta e imersiva."
        },
        "vilaromana": {
          "company": "Vila Romana",
          "location": "Itupeva, São Paulo, Brasil",
          "title": "Vendedor",
          "date": "Janeiro - Julho 2021",
          "description": "A Vila Romana é uma loja especializada em roupas de negócios, incluindo camisas, calças, ternos e acessórios.\n\nComo Vendedor, minhas responsabilidades incluíam:\n\n· Auxiliar clientes na escolha e compra de roupas e acessórios de negócios.\n· Fornecer informações detalhadas sobre os produtos e recomendações baseadas nas necessidades dos clientes.\n· Desenvolver habilidades de comunicação e a capacidade de interagir de forma eficaz com uma clientela diversificada.\n· Manter o estoque da loja e garantir um alto padrão de atendimento ao cliente."
        },
        "ambev": {
          "company": "Ambev (parte da AB InBev)",
          "location": "Jundiaí, São Paulo, Brasil",
          "title": "Jovem Aprendiz",
          "date": "Abril 2017 - Março 2018",
          "description": "A Ambev é uma grande empresa brasileira de cervejaria com presença em diversos países.\n\nComo Jovem Aprendiz, minhas responsabilidades incluíam:\n\n· Auxílio na preparação dos treinamentos dos funcionários e análise dos resultados pós-treinamento.\n· Assistência aos gerentes da área de embalagem.\n· Utilização de ferramentas do pacote Microsoft Office, como Excel, para controle de produção e treinamento de fábrica.\n\nComecei como aprendiz em Recursos Humanos e fui realocado para o setor de Embalagem. Adquiri experiência trabalhando tanto no escritório quanto na produção/armazém, desenvolvendo a habilidade de interagir com todos os níveis da empresa, desde trabalhadores da fábrica até gerentes."
        },
        "adoniroladeira": {
          "company": "Escola Estadual Professor Adoniro Ladeira",
          "location": "Jundiaí, São Paulo, Brasil",
          "title": "Aprendiz",
          "date": "2013",
          "description": "A Escola Estadual Professor Adoniro Ladeira é uma instituição educacional que oferece ensino de qualidade para estudantes do ensino fundamental e médio.\n\nComo Aprendiz, minhas responsabilidades incluíam:\n\n· Auxiliar estudantes do ensino médio e superior em suas aulas de informática.\n· Assistir os professores na preparação"
        }
      }
    },
    "contact": {
      "header": "Contato",
      "button": "Enviar",
      "placeholder": {
        "name": "Nome",
        "email": "Email",
        "message": "Digite sua mensagem!"
      },
      "success": "Sua mensagem foi enviada com sucesso! Obrigado por entrar em contato."
    },
    "pagination": {
      "home": "Home",
      "projects": "Projetos",
      "aboutme": "Sobre Mim",
      "contact": "Contato"

    }
  }
}
